{
  "experiences": [
    {
      "year": "2022 - 2024",
      "title": "Senior Software Developer (Web) - ATB Ventures",
      "link": "https://atbventures.com",
      "github_handle": "atb-ventures",
      "description": [
        "Led the system architecture and development of full stack applications for
several Proof-of-Concepts (POC) and MVPs.",
      "Spearheaded multiple architecture discovery to validate the tech solutions
and worked with product teams to build roadmaps.",
      "Championed the Think Build Ship process working closely with engineering
leadership to reduce RFC cycles and improve review and feedback mechanisms.",
      "Privacy and security first development by shifting left and architecting and
developing apps with best practices and enterprise standards in mind.",
      "Integrated Stripe and Flinks to enhance financial data connectivity and
payment processing capabilities",
      "Built applications using ReactJS, TypeScript, NextJS within Google Cloud Platform (GCP), ensuring
scalable, maintainable, and high performing web solutions."],
      "stack": [
        "React",
        "Next",
        "Nest",
        "TS",
        "Tailwind",
        "Material UI",
        "Postgres",
        "GH Actions",
        "Figma",
        "Apigee"
      ]
    },
    {
      "year": "2021 - 2022",
      "title": "Lead Frontend Developer - Helcim",
      "link": "https://helcim.com",
      "github_handle": "helcim",
      "description": [
        "Led a front end engineering team in developing and maintaining a robust Vue
based UI component library.",
        "Spearheaded library code reviews, ensuring performance optimization,
accessibility, and maintainability.",
        "Defined best practices for design system implementation, resulting in a more
cohesive UI across multiple platforms ie. POS, Invoicing, Virtual Terminal,
Recurring Payments, Payment Pages and internal systems.",
        "Collaborated with product owners and stakeholders to define project scope
and technical requirements.",
      ],
      "stack": ["Vue", "JS", "SCSS", "Gitlab", "Figma", "Storybook", "Jest"]
    },
    {
      "year": "2019 - 2021",
      "title": "Frontend Developer - Helcim",
      "link": "https://helcim.com",
      "github_handle": "helcim",
      "description": [
        "Engineered an in-house design system using Vue.js for a major platform overhaul, enhancing visual coherence and user experience.",
        "Successfully implemented the new design system across multiple systems, ensuring a consistent look and feel at launch.",
        "Took ownership of front-end bug resolutions across all platforms, ensuring a smooth user experience.",
        "Crafted all screens for a mobile web application, optimizing for responsiveness and usability."
      ],
      "stack": [
        "Vue",
        "JS",
        "SCSS",
        "Gitlab",
        "Figma",
        "Adobe XD",
        "PHP",
        "MySQL"
      ]
    },
    {
      "year": "2018 - 2019",
      "title": "Fullstack Developer - Helcim",
      "link": "https://helcim.com",
      "github_handle": "helcim",
      "description": [
        "Developed and maintained a referral Customer Relationship Management (CRM) system within a legacy environment.",
        "Created and managed a blog CRM using Vue.js, enhancing content delivery and internal team usage.",
        "Undertook website maintenance responsibilities to ensure seamless functionality.",
        "Curated and centralized style assets into a library for streamlined global usage."
      ],
      "stack": ["Vue", "JS", "SCSS", "Bitbucket", "Adobe XD", "PHP", "MySQL"]
    }
  ]
}
